Revit 2025 API
BrowserOrganization.SortingParameterId Property
 The Id of the parameter used to determine the sorting order of items in the browser.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public ElementId SortingParameterId { get; }
Public ReadOnly Property SortingParameterId As ElementId
	Get
public:
property ElementId^ SortingParameterId {
	ElementId^ get ();
}
member SortingParameterId : ElementId with get
Property Value
ElementId
See Also
Reference
BrowserOrganization Class
Autodesk.Revit.DB Namespace